Documents/ВозвратТовараПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратТовараПоставщику</Name>
			<Comment>Возврат товара поставщику</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказовРозницы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДоходыРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыВеденияУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/МетодыВеденияУчетаДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>МетодыВеденияУчетаДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кассовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Некассовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратТовараПоставщику/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") Тогда
		Валюта = ДанныеЗаполнения.Валюта;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		Подразделение = ДанныеЗаполнения.Подразделение;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары, 
						"Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЕдиницаИзмерения,Количество,Коэффициент");
		КонецЦикла;
		
	КонецЕсли;
	
	СтатьяДоходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект);
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//ТоварыНаСкладах
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, Товары, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	Иначе
		//++ №8793 товары нужно свернуть, чтобы корректно списать себестоимость
		мТовары = Товары.Выгрузить();
		мТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
		//-- №8793
		Для Каждого Товар Из мТовары Цикл
			Расход = Движения.ТоварыНаСкладах.Добавить();
			Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
			Расход.Период = ДатаДвижения;
			Расход.Организация = ОрганизацияТоваров;
			Расход.Склад = Склад;
			Расход.Номенклатура = Товар.Номенклатура;
			Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Расход.Количество = Товар.Количество * Товар.Коэффициент;
			////#8288
			//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
			Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
		КонецЦикла;
	КонецЕсли;
	
	//ВзаиморасчетыСКонтрагентами
	ВремСуммаДокумента = 0;
	ВремСуммаДокумента = Товары.Итог("Сумма");
	Если НЕ Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьПриход(Ссылка, Организация, Контрагент, ДоговорКонтрагента, ВремСуммаДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
				Движение.СуммаРасходов 	= 0;
			КонецЦикла;			
		КонецЕсли;
	КонецЕсли;
	
	// ОбеспечениеЗаказовРозницы
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Если РегистрыНакопления.ОбеспечениеЗаказовРозницы.ТребуетсяЗаписьПоОснованию(Основание.Основание) Тогда

			Движения.ОбеспечениеЗаказовРозницы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Если (НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комната) И СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам)
					ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Назначение)
					ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
					Продолжить;
				КонецЕсли;
				
				Движение = Движения.ОбеспечениеЗаказовРозницы.Добавить();
				//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Заказ 			= Основание.Основание;
				Движение.Период 		= Дата;			
				Движение.Номенклатура 	= ТекущаяСтрока.Номенклатура;
				Движение.ХарактеристикаНоменклатуры 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
				Движение.Комната 		= ТекущаяСтрока.Комната;
				Движение.Назначение 	= ТекущаяСтрока.Назначение;
				Движение.Количество 	= -ТекущаяСтрока.Количество;
				Движение.КоличествоПоФакту = -ТекущаяСтрока.Количество;
				//#4679
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда 
					Движение.Количество = -1;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;

	//заказы поставщикам
	//Движения.ЗаказыПоставщикам.Записывать = Истина;
	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		Если ЗначениеЗаполнено(Основание.Основание) И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда	
			
			ТаблицаТоваровКСписанию = Товары.Выгрузить();
			ТаблицаТоваровКСписанию.Колонки.Добавить("Потолок");
			Для каждого СтрокаТЗ из ТаблицаТоваровКСписанию Цикл
				СтрокаТЗ.Количество = -СтрокаТЗ.Количество;
			КонецЦикла;
			Движения.ЗаказыПоставщикам.ВыполнитьРасход(Ссылка, Дата, Основание.Основание, Организация, ТаблицаТоваровКСписанию, Отказ); //делаем именно так, чтобы отрабатывало ОжидаемыеПоставки_Рассчитать
		
			//Для Каждого СтрокаТовара Из Товары Цикл
			//	Движение = Движения.ЗаказыПоставщикам.Добавить();
			//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//	Движение.Период = Дата;
			//	Движение.ЗаказПоставщику = Основание.Основание;
			//	Движение.Организация = Организация;
			//	Движение.Номенклатура = СтрокаТовара.Номенклатура;
			//	Движение.Количество = -СтрокаТовара.Количество * Товар.Коэффициент;
			//	//Движение.Потолок = СтрокаТовара.Потолок;
			//	Движение.Цена = СтрокаТовара.Цена;
			//	Движение.ЕдиницаИзмерения = СтрокаТовара.ЕдиницаИзмерения;
			//	Движение.Сумма = СтрокаТовара.Сумма; //#8742
			//КонецЦикла;				
		КонецЕсли;
	КонецЕсли;
	
	//#16643
	Если ЗначениеЗаполнено(Основание) Тогда		
		ОснованиеДокумента = Неопределено;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ОснованиеДокумента = Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
			ОснованиеДокумента = Основание.Основание;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОснованиеДокумента) Тогда		
			ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(ОснованиеДокумента);
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ЗаказыПоставщикам.ОчиститьДвижения(Ссылка, Отказ); // нужно для ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу
	
	//#16643
	Если ЗначениеЗаполнено(Основание) Тогда		
		ОснованиеДокумента = Неопределено;
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ОснованиеДокумента = Основание;
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") И ТипЗнч(Основание.Основание) = Тип("ДокументСсылка.ЗаказПоставщику")  Тогда
			ОснованиеДокумента = Основание.Основание;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОснованиеДокумента) Тогда		
			ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(ОснованиеДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14675
	СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли
